'use strict';

module.exports = ['$state',function($state){
	var self = this;

	this.config = {};

	//显示加载
	this.loading = function(){
		this.config.loading = true;
	}

	//隐藏
	this.hide = function(){
		this.config = {};
	}

	//配置显示
	this.confirm = function(cfn){
		var config = {};
		config.template = cfn.template? cfn.template : 'com/services/shade/index.html';
		config.title = cfn.title;
		config.content = cfn.content;
		config.button = cfn.button;
		this.config = config;
	}

	//错误显示
	this.error = function(code){
		var array = {
			"-20002": "当前版本无法匹配您的高智商,请升级",
			"-20100": "哔哔-您输入的手机号码不合法",
			"-20101": "该用户不在这个星球哦",
			"-20102": "该手机号码已被注册",
			"-20103": "您输入的密码不正确",
			"-20104": "您输入的手机号码或验证码不正确",
			"-20105": "您输入的推荐码不存在",
			"-20106": "前方高能,请您登陆",
			"-20107": "您输入的用户名称长度不规范",
			"-20108": "当前余额不足",
			"-20109": "当前账号已在其他设备登陆",
			"-20110": "该用户已被禁用",
			"-20200": "活动不存在",
			"-20201": "同一人同一商品只能创建一次活动",
			"-20202": "购买份数不能大于剩余份数",
			"-20203": "总份数不能大于商品价格",
			"-20204": "活动已售完",
			"-20205": "活动已结束",
			"-20206": "活动已过期",
			"-20207": "支付失败!已将您的款项退回您的账户",
			"-20210": "您已购买该商品,请勿重复购买",
			"-20211": "抢的人太多，实际为您购买了N份，多支付的金额已退回到您的账户",
			"-20300": "商品不存在",
			"-20600": "订单不存在",
			"-20601": "订单支付失败",
			"-20602": "没有支付",
			"-20700": "当前用户已是您的好友,请勿重复添加",
			"-20701": "您已发过好友请求,请勿重复邀请",
			"-20702": "好友请求不存在",
			"-20703": "人艰不拆,请勿添加自己为好友",
			"-20800": "当前没有中奖信息",
			"-20801": "openId不存在，或没有关注公众号",
			"-20901": "您输入的验证码不正确",
			"-20902": "不能重复发送",
			"-21101": "推广批次已结束",
			"-21102": "来迟一步,下次请早哦",
			"-21105": "今天已经抢过了,请您明天继续",
			"-21500": "可提现金额不足",
			"-21501": "当日提现次数超过限制",
			"-21107": "推广已支付",
			"-21401": "微信unionid未上传",
			"-21402": "微信用户信息保存失败",
			"-21403": "用户已参加过活动不支持使用第一次绑定手机号",
			"-21404": "unionid不存在",
			"-21409": "用户没有绑定微信号",
			"-21410": "微信不匹配",
			"-21408": "已经授权过",
			"-21405": "此手机号已经绑定了微信号",
			"-21406": "此微信号已经绑定了手机号",
			"-21407": "此微信号已经登录过",
			"-21500": "可提现金额不足",
			"-21501": "当日提现次数超过限制",
			"-21502": "提现金额错误",
			"-32602": "前方高能,请您登陆",
		};
		if (code) {
			var message = array[code];
			if (message === "undefined") {
				this.confirm({
					content: "未知错误！请反馈给客服人员！",
					button:[
						{
							text:'确定',
							callback:function(){
								self.hide();
							}
						}
					]
				});
			} else {
				if (code == "-20106") {
					$state.go('user.login');	
				} else {
					this.confirm({
						content: message,
						button:[
							{
								text:'确定',
								callback:function(){
									self.hide();
								}
							}
						]
					});
				}
			}
		} else {
			this.confirm({
				content: "未知错误！请反馈给客服人员！",
				button:[
					{
						text:'确定',
						callback:function(){
							self.hide();
						}
					}
				]
			});
		}
	}

}]